app/controllers/destinations_controller.rb

  def index
    @destinations = Destination.all
---
SELECT "destinations".* FROM "destinations"

  def set_destination
    @destination = Destination.find(params[:id])
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]