app/controllers/destinations_controller.rb

  def index
    if params[:destination_id].present?
      # Find and display only the selected destination.
      @destinations = [Destination.find(params[:destination_id])]
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]