app/views/destinations/index.html.erb

SELECT "destinations"."name" FROM "destinations"
---
  <%= form.label :destination_id, 'Choose a destination:' %>
  <%= form.select :destination_id, Destination.all.map { |d| [d.name, d.id] }, include_blank: true %>